from window import *
import os


if __name__ == '__main__':
    os.system('cls')  #  Очищення консолі
    root.mainloop()  #  Запуск головного циклу програми

    #            ТЕСТИ

    # 1. Матриця А - буква           |  +
    # 2. Матриця А - замало чисел    |  +
    # 3. Матриця А - забагато чисел  |  +
    # 4. Матриця А - не квадратна    |  +
    # 5. Вектор b  - буква           |  +
    # 6. Вектор b  - замало чисел    |  +
    # 7. Вектор b  - забагато чисел  |  +
    # 8. Вектор b  - більше 1 числа  |  +
